"""
Урок 11: Циклы for и while, основные конструкции
"""

# Цикл for
"""
Цикл for используется для перебора элементов последовательности (списка, строки, кортежа, множества или диапазона чисел).
Синтаксис:

for переменная in последовательность:
    # тело цикла
    действие

Примеры использования:
"""
# Перебор элементов списка
# fruits = ["яблоко", "банан", "вишня"]
# for fruit in fruits:
#     print(fruit)  # Выведет каждый фрукт в списке

# Перебор символов строки
# for char in "Python":
#     print(char)  # Выведет каждый символ строки


# range()
"""
Функция range() генерирует последовательность чисел.
Синтаксис:
    range(start, stop, step)

- start (необязательно) - начальное значение (по умолчанию 0)
- stop - конечное значение (не включается в диапазон)
- step (необязательно) - шаг (по умолчанию 1)

Примеры:
"""
# print(list(range(5)))       # [0, 1, 2, 3, 4]
# print(list(range(2, 8)))    # [2, 3, 4, 5, 6, 7]
# print(list(range(1, 10, 4)))  # [1, 4, 7]  [1,2,3,4,5,6,7,8,9]
# print(list(range(10, 0, -2)))  # [10, 8, 6, 4, 2]

# Перебор чисел с помощью range()
# for i in range(1, 6):
#     print(i)  # Выведет числа от 1 до 5

# Использование range() с шагом
# for i in range(2, 10, 2):
#     print(i)  # Выведет 2, 4, 6, 8


# Вложенные циклы
"""
Вложенные циклы позволяют перебирать при этом другую последовательность внутри.

Пример: Вывести построчно таблицу умножения до 5x5.
"""
# 1,2,3,4,5
# 1,2,3,4,5
# 1,2,3,4,5
# 1,2,3,4,5
# print(i, end="\t")  # end именованный аргумент по дефолту установлен в /n(переход вывода на новую строку)


# for i in range(1, 6):
#     for j in range(1, 6):
#         print(j * i, end="\t")
#     print()  # Новая строка после каждого ряда


# Цикл while
"""
Цикл while выполняется, пока заданное условие истинно.
Синтаксис:

while условие:
    # тело цикла
    действие

Пример:
"""
# x = 1
# while x < 10:
#     print(x)
#     x += 1  # Уменьшаем x на 1, x += 1
# got_message = False
# while not got_message:
#     print("Waiting for message...")
#     response = input("Input message: ")
#     if response != "":
#         got_message = True
#         print("Got message:", response)


# ОЗНАКОМИТЕЛЬНЫЕ ЗАДАЧИ (10 задач)

# 1. Выведите числа от 1 до 10 с помощью for
# for i in range(1, 11):
#     print(i)
# 2. Выведите числа от 10 до 1 с помощью while
# x = 10
# while x >= 1:
#     print(x)
#     x -= 1
# 3. Выведите все чётные числа от 2 до 20
# for i in range(2, 20, 2):
#     print(i)
# 4. Найдите сумму чисел от 1 до 100

# 5. Запросите у пользователя число и выведите его факториал
# 6. Используйте while, чтобы вывести квадраты чисел от 1 до 10
# 7. Найдите сумму всех нечётных чисел от 1 до 50
# 8. Используйте цикл for, чтобы вывести символы строки "Python"
# 9. Создайте список чисел и найдите их среднее значение
# 10. Напишите программу, которая запрашивает у пользователя числа, пока он не введёт 0


# ДОМАШНЕЕ ЗАДАНИЕ (40 задач)
import random

# 11. Выведите таблицу умножения на 5
for i in range(1, 11):
    print(f"5 x {i} = {5 * i}")
# 12. Выведите все числа кратные 3 от 1 до 100
print([i for i in range(1, 101) if i % 3 == 0])
# 13. Запросите у пользователя число и выведите его таблицу умножения
n = int(input("Введите число: "))
for i in range(1, 11):
    print(f"{n} x {i} = {n * i}")
# 14. Найдите сумму всех чисел от 1 до N (N вводит пользователь)
N = int(input("Введите N: "))
print(sum(range(1, N + 1)))
# 15. Выведите числа Фибоначчи до 100
a, b = 0, 1
while a <= 100:
    print(a, end=' ')
    a, b = b, a + b
print()
# 16. Проверьте, является ли введённое число простым
num = int(input("Введите число: "))
if num < 2:
    print("Не простое")
elif all(num % i != 0 for i in range(2, int(num ** 0.5) + 1)):
    print("Простое")
else:
    print("Не простое")
# 17. Переверните строку, введённую пользователем
s = input("Введите строку: ")
print(s[::-1])
# 18. Посчитайте количество гласных букв в строке
s = input("Введите строку: ").lower()
vowels = "аеёиоуыэюя"
print(sum(1 for char in s if char in vowels))
# 19. Посчитайте сумму цифр числа
n = input("Введите число: ")
print(sum(int(d) for d in n if d.isdigit()))
# 20. Запросите у пользователя строку и выведите её без гласных
s = input("Введите строку: ")
vowels = "аеёиоуыэюяАЕЁИОУЫЭЮЯ"
print("".join(c for c in s if c not in vowels))
# 21. Сгенерируйте список из 10 случайных чисел и выведите их среднее значение
nums = [random.randint(1, 100) for _ in range(10)]
print(nums)
print("Среднее:", sum(nums) / len(nums))
# 22. Определите, является ли введённая строка палиндромом
s = input("Введите строку: ")
print("Палиндром" if s == s[::-1] else "Не палиндром")
# 23. Используйте while для создания обратного отсчёта от 10 до 1
i = 10
while i >= 1:
    print(i)
    i -= 1
# 24. Выведите квадраты всех чётных чисел от 1 до 50
print([i ** 2 for i in range(1, 51) if i % 2 == 0])
# 25. Найдите максимальное число в списке
nums = [10, 23, 5, 87, 19]
print("Максимум:", max(nums))
# 26. Выведите все пары чисел от 1 до 10, сумма которых равна 10
for i in range(1, 11):
    for j in range(1, 11):
        if i + j == 10:
            print((i, j))
# 27. Запросите у пользователя 5 чисел и выведите их среднее
nums = [int(input(f"Введите число {i+1}: ")) for i in range(5)]
print("Среднее:", sum(nums) / len(nums))
# 28. Используйте цикл while, чтобы угадать число, загаданное программой
secret = random.randint(1, 20)
guess = None
while guess != secret:
    guess = int(input("Угадайте число от 1 до 20: "))
    if guess < secret:
        print("Больше")
    elif guess > secret:
        print("Меньше")
print("Угадали!")
# 29. Сгенерируйте таблицу квадратов чисел от 1 до 10
for i in range(1, 11):
    print(f"{i}² = {i ** 2}")
# 30. Найдите количество чётных и нечётных чисел в списке
lst = [1, 2, 3, 4, 5, 6, 7]
even = len([x for x in lst if x % 2 == 0])
odd = len(lst) - even
print(f"Чётных: {even}, Нечётных: {odd}")
# 31. Определите наибольший общий делитель (НОД) двух чисел
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
while b:
    a, b = b, a % b
print("НОД:", a)
# 32. Найдите все простые числа в диапазоне от 1 до 100
primes = []
for num in range(2, 101):
    if all(num % i != 0 for i in range(2, int(num ** 0.5) + 1)):
        primes.append(num)
print(primes)
# 33. Создайте список из первых 10 чисел Фибоначчи
fib = [0, 1]
for _ in range(8):
    fib.append(fib[-1] + fib[-2])
print(fib)
# 34. Подсчитайте, сколько раз встречается определённая буква в строке
s = input("Введите строку: ")
letter = input("Введите букву: ")
print(s.count(letter))
# 35. Найдите сумму элементов списка, которые больше 10
lst = [4, 12, 7, 15, 22]
print(sum(x for x in lst if x > 10))
# 36. Проверьте, являются ли два введённых слова анаграммами
w1 = input("Введите первое слово: ")
w2 = input("Введите второе слово: ")
print("Анаграмма" if sorted(w1) == sorted(w2) else "Не анаграмма")
# 37. Создайте программу, которая заменяет все пробелы в строке на подчеркивания
s = input("Введите строку: ")
print(s.replace(" ", "_"))
# 38. Определите, сколько раз в строке встречается определённое слово
s = input("Введите строку: ")
word = input("Введите слово: ")
print(s.count(word))
# 39. Напишите программу, которая считает, сколько раз в строке встречаются цифры
s = input("Введите строку: ")
print(sum(1 for c in s if c.isdigit()))
# 40. Используйте цикл while, чтобы находить сумму вводимых пользователем чисел, пока он не введёт "стоп"
total = 0
while True:
    s = input("Введите число или 'стоп': ")
    if s.lower() == "стоп":
        break
    if s.isdigit():
        total += int(s)
print("Сумма:", total)

